rcd-dpeng/skillBuildingSheet5/Libraries/RpiMIB/Number2.cydsn/Generated_Source/PSoC5/Slush_I2C_int_signals.h
/*******************************************************************************
* File Name: Slush_I2C_int_signals.h  
* Version 1.90
*
* Description:
*  This file containts Status Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_STATUS_REG_Slush_I2C_int_signals_H) /* CY_STATUS_REG_Slush_I2C_int_signals_H */
#define CY_STATUS_REG_Slush_I2C_int_signals_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
    #include "CyLib.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 statusState;

} Slush_I2C_int_signals_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

uint8 Slush_I2C_int_signals_Read(void) ;
void Slush_I2C_int_signals_InterruptEnable(void) ;
void Slush_I2C_int_signals_InterruptDisable(void) ;
void Slush_I2C_int_signals_WriteMask(uint8 mask) ;
uint8 Slush_I2C_int_signals_ReadMask(void) ;


/***************************************
*           API Constants
***************************************/

#define Slush_I2C_int_signals_STATUS_INTR_ENBL    0x10u


/***************************************
*         Parameter Constants
***************************************/

/* Status Register Inputs */
#define Slush_I2C_int_signals_INPUTS              2


/***************************************
*             Registers
***************************************/

/* Status Register */
#define Slush_I2C_int_signals_Status             (* (reg8 *) Slush_I2C_int_signals_sts_intr_sts_reg__STATUS_REG )
#define Slush_I2C_int_signals_Status_PTR         (  (reg8 *) Slush_I2C_int_signals_sts_intr_sts_reg__STATUS_REG )
#define Slush_I2C_int_signals_Status_Mask        (* (reg8 *) Slush_I2C_int_signals_sts_intr_sts_reg__MASK_REG )
#define Slush_I2C_int_signals_Status_Aux_Ctrl    (* (reg8 *) Slush_I2C_int_signals_sts_intr_sts_reg__STATUS_AUX_CTL_REG )

#endif /* End CY_STATUS_REG_Slush_I2C_int_signals_H */


/* [] END OF FILE */
